<center> <img src = https://raw.githubusercontent.com/AndreyRysistov/DatasetsForPandas/main/hh%20label.jpg alt="drawing" style="width:400px;">

# Проект «Анализ вакансий из HeadHunter»

In [256]:
import pandas as pd
import psycopg2

In [ ]:
# вставьте сюда параметры подключения из юнита 1. Работа с базой данных из Python
connection = psycopg2.connect(
    dbname= 'project_sql',
    user= 'skillfactory',
    host='84.201.134.129',
    password='cCkxxLVrDE8EbvjueeMedPKt',
    port=5432
)

In [ ]:
connection = psycopg2.connect(
   dbname=DBNAME,
   user=USER,
   host=HOST,
   password=PASSWORD,
   port=PORT
)

## 3. Предварительный анализ данных

1. Напишите запрос, который посчитает количество вакансий в базе (вакансии находятся в таблице `vacancies`).

In [278]:
# текст запроса
n = 10
query = f'''select count(*)
            from public.vacancies 
            limit {n}
         '''
df = pd.read_sql_query(query, connection)
df

C:\Users\Struc\AppData\Local\Temp\ipykernel_18512\436400575.py:7: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

   count
0  49197

In [28]:
# результат запроса
49197

49197

2. Напишите запрос, который посчитает количество работодателей (таблица `employers`).

In [48]:
# текст запроса
n = 10
query = f'''select count(*) 
            from public.employers 
            limit {n}
         '''
df = pd.read_sql_query(query, connection)
df

C:\Users\Struc\AppData\Local\Temp\ipykernel_5060\3622967953.py:7: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

   count
0  23501

In [ ]:
# результат запроса
23501

3. Посчитайте с помощью запроса количество регионов (таблица `areas`).

In [49]:
# текст запроса
n = 10
query = f'''select count(*) 
            from public.areas 
            limit {n}
         '''
df = pd.read_sql_query(query, connection)
df

C:\Users\Struc\AppData\Local\Temp\ipykernel_5060\3033838267.py:7: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

   count
0   1362

In [ ]:
# результат запроса
1362

4. Посчитайте с помощью запроса количество сфер деятельности в базе (таблица `industries`).

In [50]:
# текст запроса
n = 10
query = f'''select count(*) 
            from public.industries 
            limit {n}
         '''
df = pd.read_sql_query(query, connection)
df

C:\Users\Struc\AppData\Local\Temp\ipykernel_5060\901102727.py:7: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

   count
0    294

In [ ]:
# результат запроса
294

***

In [ ]:
# выводы по предварительному анализу данных
Всего 49197 вакансий и 23501 работодателей в 1362 регионах по 294 сферам деятельности.

## 4. Детальный анализ вакансий

1. Напишите запрос, который позволит узнать, сколько (`cnt`) вакансий в каждом регионе (`area`).
Отсортируйте по количеству вакансий в порядке убывания.

In [51]:
# текст запроса
n = 5
query = f'''select t2.name, count(t1.name) as cnt
            from public.vacancies as t1
            join public.areas as t2 on t1.area_id=t2.id
            group by t2.name
            order by count(t1.name) DESC
            limit {n}
         '''
df = pd.read_sql_query(query, connection)
df

C:\Users\Struc\AppData\Local\Temp\ipykernel_5060\2423926241.py:10: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

              name   cnt
0           Москва  5333
1  Санкт-Петербург  2851
2            Минск  2112
3      Новосибирск  2006
4           Алматы  1892

In [ ]:
# результат запроса
   name	            cnt
0	Москва	         5333
1	Санкт-Петербург	2851
2	Минск	            2112
3	Новосибирск	      2006
4	Алматы	         1892

2. Напишите запрос, чтобы определить у какого количества вакансий заполнено хотя бы одно из двух полей с зарплатой.

In [52]:
# текст запроса

query = f'''select count(*) 
            from public.vacancies 
            where salary_from is not NULL or salary_to is not NULL
            
         '''
df = pd.read_sql_query(query, connection)
df

C:\Users\Struc\AppData\Local\Temp\ipykernel_5060\532353395.py:8: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

   count
0  24073

In [ ]:
# результат запроса
24073

3. Найдите средние значения для нижней и верхней границы зарплатной вилки. Округлите значения до **целого числа**.

In [53]:
# текст запроса

query = f'''select avg(salary_from), avg(salary_to)
            from public.vacancies 
            
         '''
df = pd.read_sql_query(query, connection)
df

C:\Users\Struc\AppData\Local\Temp\ipykernel_5060\2483099128.py:7: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

            avg            avg
0  71064.657901  110536.741923

In [ ]:
# результат запроса
Зарплатная вилка от 71065 до 110537

4. Напишите запрос, который выведет количество вакансий для каждого сочетания типа рабочего графика (`schedule`) и типа трудоустройства (`employment`), используемого в вакансиях. Результат отсортируйте по убыванию количества.

In [54]:
# текст запроса
n = 3
query = f'''select  schedule, employment, count(*)
            from public.vacancies 
            group by schedule, employment
            order by count(*) DESC
            limit {n}
         '''
df = pd.read_sql_query(query, connection)
df

C:\Users\Struc\AppData\Local\Temp\ipykernel_5060\306935662.py:9: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

           schedule        employment  count
0       Полный день  Полная занятость  35367
1  Удаленная работа  Полная занятость   7802
2     Гибкий график  Полная занятость   1593

In [ ]:
# результат запроса
По популярности на втором месте удаленная работа и полная занятость.

5. Напишите запрос, выводящий значения поля «Требуемый опыт работы» (`experience`) в порядке возрастания количества вакансий, в которых указан данный вариант опыта.

In [55]:
# текст запроса
n = 10
query = f'''select  experience, count(*)
            from public.vacancies 
            group by experience
            order by count(*) 
            limit {n}
         '''
df = pd.read_sql_query(query, connection)
df

C:\Users\Struc\AppData\Local\Temp\ipykernel_5060\2934771474.py:9: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

           experience  count
0         Более 6 лет   1337
1           Нет опыта   7197
2       От 3 до 6 лет  14511
3  От 1 года до 3 лет  26152

In [ ]:
# результат запроса
    experience	         count
0	Более 6 лет	        1337
1	Нет опыта	        7197
2	От 3 до 6 лет	    14511
3	От 1 года до 3 лет	26152

***

In [ ]:
# выводы по детальному анализу вакансий
Наибольшее количество вакансий (почти треть от всех) в Москве, Санкт-Петербурге, Минске, Новосибирске и Алма-Аты. 
Поля с зарплатой указаны только в половине вакансий. 
В среднем величина зарплат от 71 до 110 тысяч.
По популярности на втором месте удаленная работа и полная занятость после полной занятости при полном дне работы.
Работодатели, в основном, объективны в требованиях к опыту работы, большинство требует опыт работы от 1 до 6 лет, меньшинство согласно взять на работу с опытом болле 6 лет или без опыта.

## 5. Анализ работодателей

1. Напишите запрос, который позволит узнать, какие работодатели находятся на первом и пятом месте по количеству вакансий.

In [183]:
# текст запроса
n = 5
query = f'''select t2.name, count(t1.name)
            from public.vacancies as t1
            join public.employers as t2 on t1.employer_id=t2.id
            
            group by t2.name
            order by count(t1.name) DESC
            limit {n}
         '''
df = pd.read_sql_query(query, connection)
df

C:\Users\Struc\AppData\Local\Temp\ipykernel_18512\719116266.py:11: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

            name  count
0         Яндекс   1933
1     Ростелеком    491
2       Тинькофф    444
3           СБЕР    428
4  Газпром нефть    331

In [ ]:
# результат запроса
На первом месте Яндекс, на пятом - Газпром нефть

2. Напишите запрос, который для каждого региона выведет количество работодателей и вакансий в нём.
Среди регионов, в которых нет вакансий, найдите тот, в котором наибольшее количество работодателей.

In [191]:
# текст запроса

query = f'''SELECT t3.name AS "регион", 
               COUNT(DISTINCT t2.id) AS "работодатель", 
               COUNT(DISTINCT t1.id) AS "вакансии"
            FROM public.areas AS t3
            LEFT JOIN public.employers AS t2 ON t2.area = t3.id
            LEFT JOIN public.vacancies AS t1 ON t1.employer_id = t2.id
            GROUP BY t3.name
            HAVING COUNT(DISTINCT t1.id) = 0
            ORDER BY COUNT(DISTINCT t2.id) DESC
            LIMIT 1
           
         '''
df = pd.read_sql_query(query, connection)
df

C:\Users\Struc\AppData\Local\Temp\ipykernel_18512\805739363.py:15: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

     регион  работодатель  вакансии
0  Серпухов             6         0

In [ ]:
# результат запроса
!6

3. Для каждого работодателя посчитайте количество регионов, в которых он публикует свои вакансии. Отсортируйте результат по убыванию количества.

In [59]:
# текст запроса
query = f'''select  t2.name as "работодатель", count(distinct area_id) as "количество регионов" 
            from public.vacancies as t1
            join public.employers as t2 on t1.employer_id=t2.id
            
            group by t2.name
            order by count(t1.name) DESC
           
         '''
df = pd.read_sql_query(query, connection)
df

C:\Users\Struc\AppData\Local\Temp\ipykernel_5060\2017708317.py:10: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

                                работодатель  количество регионов
0                                     Яндекс                  181
1                                 Ростелеком                  152
2                                   Тинькофф                   43
3                                       СБЕР                   24
4                              Газпром нефть                   24
...                                      ...                  ...
14761             ПСБ Инновации и Инвестиции                    1
14762                             ПСЗ Янтарь                    1
14763                                    ПСК                    1
14764  Псковский завод механических приводов                    1
14765                     ПСК ТатЭнергоСтрой                    1

[14766 rows x 2 columns]

In [ ]:
# результат запроса
Максимальное значение 181

4. Напишите запрос для подсчёта количества работодателей, у которых не указана сфера деятельности.

In [93]:
# текст запроса
query = f'''select distinct employer_id 
            from public.employers_industries
           
         '''
df = pd.read_sql_query(query, connection)
df

C:\Users\Struc\AppData\Local\Temp\ipykernel_5060\597871324.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

       employer_id
0           147714
1          1147526
2           635840
3          2412374
4           540336
...            ...
15077          536
15078      3590430
15079      2748834
15080        67563
15081      5969955

[15082 rows x 1 columns]

In [ ]:
# результат запроса
Всего 23501 зарегистрированных работодателей, 
из них в таблице указаны employers_industries 15082. 
Значит 23501-15081=8419 не указали сферу деятельности

5. Напишите запрос, чтобы узнать название компании, находящейся на третьем месте в алфавитном списке (по названию) компаний, у которых указано четыре сферы деятельности.

In [252]:
# текст запроса
query = f'''select t2.name as n, count(t1.industry_id) as s
            from public.employers_industries as t1
            join public.employers as t2 on t1.employer_id=t2.id
            group by t2.name
            having count(t1.industry_id)=4
            order by n
            limit 3
         '''
df = pd.read_sql_query(query, connection)
df

C:\Users\Struc\AppData\Local\Temp\ipykernel_18512\3006029466.py:10: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

              n  s
0  101 Интернет  4
1      21vek.by  4
2          2ГИС  4

In [ ]:
# результат запроса
2ГИС

6. С помощью запроса выясните, у какого количества работодателей в качестве сферы деятельности указана «Разработка программного обеспечения».

In [193]:
# текст запроса
query = f'''select t2.name as n, count(t1.employer_id) as s
            from public.employers_industries as t1
            join public.industries as t2 on t1.industry_id=t2.id
            group by n
            having t2.name = 'Разработка программного обеспечения'
            order by n
            
         '''
df = pd.read_sql_query(query, connection)
df

C:\Users\Struc\AppData\Local\Temp\ipykernel_18512\2196655629.py:10: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

                                     n     s
0  Разработка программного обеспечения  3553

In [ ]:
# результат запроса
3553

7. Для компании «Яндекс» выведите список [городов-миллионников](https://ru.wikipedia.org/wiki/%D0%93%D0%BE%D1%80%D0%BE%D0%B4%D0%B0-%D0%BC%D0%B8%D0%BB%D0%BB%D0%B8%D0%BE%D0%BD%D0%B5%D1%80%D1%8B_%D0%A0%D0%BE%D1%81%D1%81%D0%B8%D0%B8), в которых представлены вакансии компании, вместе с количеством вакансий в этих регионах. Также добавьте строку "Total" с общим количеством вакансий компании. Результат отсортируйте по возрастанию количества.

    Если возникнут трудности с этим заданием, посмотрите материалы модуля 6.4 «Как получать данные из веб-источников и API».

In [246]:
# текст запроса
query = f'''WITH million_cities AS (
    SELECT 'Москва' AS city
    UNION ALL SELECT 'Санкт-Петербург'
    UNION ALL SELECT 'Новосибирск'
    UNION ALL SELECT 'Екатеринбург'
    UNION ALL SELECT 'Нижний Новгород'
    UNION ALL SELECT 'Казань'
    UNION ALL SELECT 'Челябинск'
    UNION ALL SELECT 'Омск'
    UNION ALL SELECT 'Самара'
    UNION ALL SELECT 'Ростов-на-Дону'
    UNION ALL SELECT 'Уфа'
    UNION ALL SELECT 'Красноярск'
    UNION ALL SELECT 'Воронеж'
    UNION ALL SELECT 'Пермь'
    UNION ALL SELECT 'Волгоград'
    UNION ALL SELECT 'Краснодар'
)
(SELECT 
    COALESCE(t4.city, 'Total') AS city,
    COUNT(t1.id) AS vacancy_count
    FROM public.vacancies AS t1
    JOIN public.employers AS t2 ON t1.employer_id = t2.id
    JOIN public.areas AS t3 ON t1.area_id = t3.id
    LEFT JOIN million_cities AS t4 ON t3.name = t4.city
    WHERE t2.name = 'Яндекс'
    GROUP BY t4.city 
    HAVING COALESCE(t4.city, '') <> ''
    ORDER BY vacancy_count ASC)

UNION ALL

SELECT 
    'TOTAL' AS city,
    COUNT(t1.id) AS vacancy_count
    FROM public.vacancies AS t1
    JOIN public.employers AS t2 ON t1.employer_id = t2.id
    JOIN public.areas AS t3 ON t1.area_id = t3.id
    LEFT JOIN million_cities AS t4 ON t3.name = t4.city
    WHERE t2.name = 'Яндекс'
    
            
        '''
df = pd.read_sql_query(query, connection)
df

C:\Users\Struc\AppData\Local\Temp\ipykernel_18512\3638992189.py:45: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

               city  vacancy_count
0              Омск             21
1         Челябинск             22
2        Красноярск             23
3         Волгоград             24
4             Пермь             25
5            Казань             25
6    Ростов-на-Дону             25
7               Уфа             26
8            Самара             26
9         Краснодар             30
10          Воронеж             32
11      Новосибирск             35
12  Нижний Новгород             36
13     Екатеринбург             39
14  Санкт-Петербург             42
15           Москва             54
16            TOTAL           1933

In [ ]:
# результат запроса
    city	        vacancy_count
0	Омск	        21
1	Челябинск	    22
2	Красноярск	    23
3	Волгоград	    24
4	Пермь	        25
5	Казань	        25
6	Ростов-на-Дону	25
7	Уфа	            26
8	Самара	        26
9	Краснодар	    30
10	Воронеж     	32
11	Новосибирск	    35
12	Нижний Новгород	36
13	Екатеринбург	39
14	Санкт-Петербург	42
15	Москва	        54
16	TOTAL       	485

***

In [ ]:
# выводы по анализу работодателей
Наибольшее количество вакансий у компании "Яндекс", который представлен в 181 городах(регионах) из них в 16 городах-миллионниках.
Топ 5 работодателй: Яндекс, Ростелеком, Тинькофф, СБЕР, Газпром нефть. 
8419 работодателя не указали сферу деятельности. Сфера деятельности "Разработка программного обеспечения" указана у 3553 работодателей.

## 6. Предметный анализ

1. Сколько вакансий имеет отношение к данным?

    Считаем, что вакансия имеет отношение к данным, если в её названии содержатся слова `'data'` или `'данн'`.

    *Обратите внимание, что названия вакансий могут быть написаны в любом регистре.*

In [117]:
# текст запроса

query = f'''select   count(lower(name)) 
            from public.vacancies 
            where lower(name) like '%данн%' or lower(name) like '%data%'
            
            
         '''
df = pd.read_sql_query(query, connection)
df

C:\Users\Struc\AppData\Local\Temp\ipykernel_18512\814247376.py:9: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

   count
0   1771

In [ ]:
# результат запроса
1771 
(lower(name) like '%scien%'  or lower(name) like '%исследов%' or lower(name) like '%ml%' or lower(name) like '%learn%' or lower(name) like '%обучен%')

2. Сколько есть подходящих вакансий для начинающего дата-сайентиста? Будем считать вакансиями для дата-сайентистов такие, в названии которых есть хотя бы одно из следующих сочетаний:
    * 'data scientist'
    * 'data science'
    * 'исследователь данных'
    * 'ML' (здесь не нужно брать вакансии по HTML)
    * 'machine learning'
    * 'машинн%обучен%'

    **В следующих заданиях мы продолжим работать с вакансиями по этому условию.**

    Считаем вакансиями для специалистов уровня Junior следующие:
    + в названии есть слово “junior” **или**
    + требуемый опыт — «Нет опыта» **или**
    + тип трудоустройства — «Стажировка».

In [155]:
query = f'''SELECT COUNT(*) AS suitable_vacancies
            FROM public.vacancies
            WHERE (
                lower(name) LIKE '%data scientist%' OR
                lower(name) LIKE '%data science%' OR
                lower(name) LIKE '%исследователь данных%' OR
                (lower(name) LIKE '%ml%' AND lower(name) NOT LIKE '%html%') OR
                lower(name) LIKE '%machine learning%' OR
                lower(name) LIKE '%машинн%обучен%'
                )
                AND ( lower(name) LIKE '%junior%' OR
                experience = 'Нет опыта' OR
                employment = 'Стажировка'
                )
         '''
df = pd.read_sql_query(query, connection)
df

C:\Users\Struc\AppData\Local\Temp\ipykernel_18512\3923553898.py:16: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

   suitable_vacancies
0                  51

In [ ]:
# результат запроса
51

3. Сколько есть вакансий для DS, в которых в качестве ключевого навыка указан SQL или Postgres?

    *Критерии для отнесения вакансии к DS указаны в предыдущем задании.*

In [215]:
# текст запроса
query = f'''SELECT COUNT(*) AS suitable_vacancies
            FROM public.vacancies
            WHERE (
                lower(name) LIKE '%data scientist%' OR
                lower(name) LIKE '%data science%' OR
                lower(name) LIKE '%исследователь данных%' OR
                (lower(name) LIKE '%ml%' AND lower(name) NOT LIKE '%html%') OR
                lower(name) LIKE '%machine learning%' OR
                lower(name) LIKE '%машинн%обучен%'
                )
                AND ( key_skills LIKE '%SQL%' OR
                key_skills LIKE '%Postgres%'
                )
         '''
df = pd.read_sql_query(query, connection)
df

C:\Users\Struc\AppData\Local\Temp\ipykernel_18512\2289549280.py:16: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

   suitable_vacancies
0                 229

In [ ]:
# результат запроса
229

4. Проверьте, насколько популярен Python в требованиях работодателей к DS. Для этого вычислите количество вакансий, в которых в качестве ключевого навыка указан Python.

    *Это можно сделать помощью запроса, аналогичного предыдущему.*

In [214]:
# текст запроса
query = f'''SELECT count(*)
            FROM public.vacancies
            WHERE (
                lower(name) LIKE '%data scientist%' OR
                lower(name) LIKE '%data science%' OR
                lower(name) LIKE '%исследователь данных%' OR
                (lower(name) LIKE '%ml%' AND lower(name) NOT LIKE '%html%') OR
                lower(name) LIKE '%machine learning%' OR
                lower(name) LIKE '%машинн%обучен%'
                )
                AND ( key_skills LIKE '%Python%'
                )
         '''
df = pd.read_sql_query(query, connection)
df

C:\Users\Struc\AppData\Local\Temp\ipykernel_18512\1244196732.py:15: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

   count
0    357

In [ ]:
# результат запроса
357

5. Сколько ключевых навыков в среднем указывают в вакансиях для DS?
Ответ округлите до **двух знаков после точки-разделителя**.

In [213]:
# текст запроса
query = f'''SELECT ROUND(AVG(skill_count), 2) AS average_key_skills
            FROM (
               SELECT id, 
                  LENGTH(key_skills) - LENGTH(REPLACE(key_skills, CHR(9), '')) + 1 AS skill_count
               FROM public.vacancies
               WHERE key_skills IS NOT NULL AND key_skills <> '' AND
                  (lower(name) LIKE '%data scientist%' OR
                     lower(name) LIKE '%data science%' OR
                     lower(name) LIKE '%исследователь данных%' OR
                     (lower(name) LIKE '%ml%' AND lower(name) NOT LIKE '%html%') OR
                     lower(name) LIKE '%machine learning%' OR
                     lower(name) LIKE '%машинн%обучен%'
                  )
                  
            ) AS subquery
         '''
df = pd.read_sql_query(query, connection)
df

C:\Users\Struc\AppData\Local\Temp\ipykernel_18512\74836813.py:18: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

   average_key_skills
0                6.55

In [ ]:
# результат запроса
6.55

6. Напишите запрос, позволяющий вычислить, какую зарплату для DS в среднем указывают для каждого типа требуемого опыта (уникальное значение из поля `experience`).

    При решении задачи примите во внимание следующее:
    1. Рассматриваем только вакансии, у которых заполнено хотя бы одно из двух полей с зарплатой.
    2. Если заполнены оба поля с зарплатой, то считаем зарплату по каждой вакансии как сумму двух полей, делённую на 2. Если заполнено только одно из полей, то его и считаем зарплатой по вакансии.
    3. Если в расчётах участвует `null`, в результате он тоже даст `null` (посмотрите, что возвращает запрос `select 1 + null`). Чтобы избежать этой ситуацию, мы воспользуемся функцией [coalesce](https://postgrespro.ru/docs/postgresql/9.5/functions-conditional#functions-coalesce-nvl-ifnull), которая заменит `null` на значение, которое мы передадим. Например, посмотрите, что возвращает запрос `select 1 + coalesce(null, 0)`

    Выясните, на какую зарплату в среднем может рассчитывать дата-сайентист с опытом работы от 3 до 6 лет. Результат округлите до **целого числа**.

In [289]:
# текст запроса
query = f''' WITH money AS 
((SELECT *
            FROM public.vacancies
            WHERE (
                lower(name) LIKE '%data scientist%' OR
                lower(name) LIKE '%data science%' OR
                lower(name) LIKE '%исследователь данных%' OR
                (lower(name) LIKE '%ml%' AND lower(name) NOT LIKE '%html%') OR
                lower(name) LIKE '%machine learning%' OR
                lower(name) LIKE '%машинн%обучен%'
                )
                AND ( experience = 'От 3 до 6 лет')
                )
            intersect 
               ( SELECT *
            FROM public.vacancies 
            WHERE (salary_from>0) OR (salary_to>0))
            )
            (SELECT  (sum(salary_from)+sum(salary_to))/(count(salary_from)+count(salary_from)) as avg_salary
        FROM money AS t1
        
    where COALESCE(t1.name, '') <> ''
    ORDER BY avg(salary_from) ASC)
            
         '''
df = pd.read_sql_query(query, connection)
df

C:\Users\Struc\AppData\Local\Temp\ipykernel_18512\190664632.py:27: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

   avg_salary
0      269537

In [ ]:
# результат запроса
269537

***

In [ ]:
# выводы по предметному анализу
Всего 1771 вакагся имеет отношение к данным. Для новичка дата-сайентиста 55 вакансий. В вакансиях DS указывают навык SQL или Postgres в 229 вакансиях, Python в 357 вакансиях.

## Общий вывод по проекту

In [ ]:
# подведем итог исследования, обобщите выводы
# здесь можно (это будет плюсом) провести дополнительные исследования данных, сделать прогнозы, продумать варианты продолжения исследования
В общей сложности в базе данных представлено 49 197 вакансий и 23 501 работодатель, охватывающих 1362 региона и 294 сферы деятельности.
Наибольшее количество вакансий (почти треть от общего числа) сосредоточено в Москве, Санкт-Петербурге, Минске, Новосибирске и Алма-Аты.
В половине вакансий указаны поля с информацией о заработной плате. Средний диапазон зарплат варьируется от 71 до 110 тысяч.
По популярности второе место занимают удалённая работа и полная занятость после полной занятости при стандартном рабочем графике.
Требования работодателей к опыту работы в основном объективны: большинство требует опыт работы от 1 до 6 лет, в то время как меньшинство готово рассмотреть кандидатов с опытом более 6 лет или без опыта.
Наибольшее количество вакансий представлено компанией «Яндекс», которая представлена в 181 городе (регионе), в том числе в 16 городах-миллионниках.
Исследование рынка труда, проведённое на платформе HH.ru, выявило, что подавляющее большинство из 49 197 вакансий сосредоточено в городах-миллионниках. В пятёрку лидеров среди работодателей вошли одна
IT-компания («Яндекс»), одна телекоммуникационная («Ростелеком»), два банка («Тинькофф» и «Сбербанк») и одна промышленная («Газпром нефть»). 
8419 работодателей не указали сферу деятельности.
Сфера деятельности «Разработка программного обеспечения» указана у 3553 работодателей.
Всего 1771 вакансия имеет отношение к данным. Для начинающего дата-сайентиста доступно 55 вакансий.
В вакансиях DS указывается навык SQL или Postgres в 229 вакансиях и Python в 357 вакансиях.